Консолидация/src/Catalogs/Базы/Базы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Базы</name>
  <attributes>
    <name>СтрокаПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Аналитика</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Консолидация/src/Catalogs/Базы/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьСписокОрганизаций(Команда)
	
	Если Объект.СтрокаПодключения = "" ИЛИ Объект.Пользователь = "" ИЛИ Объект.Пароль = "" Тогда
		Сообщить("Заполните параметры подключения!");
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка = ПредопределенноеЗначение("Справочник.Базы.ПустаяСсылка") Тогда
		Сообщить("Перед заполнении запишите элемент справочника");
		Возврат;
	КонецЕсли;	
				
	ЗаполнитьСписокОрганизацийНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОрганизацийНаСервере()
	
	МассивОрг = Справочники.Базы.ПолучитьСписокОрганизацийИсточника(Объект.Ссылка, Объект.Пользователь, Объект.Пароль);
	
	Для Каждого Стр Из МассивОрг Цикл
		
		СтрОрг = Объект.Организации.Добавить();
		СтрОрг.Организация = Стр;
		
	КонецЦикла;	
	
КонецПроцедуры
